import React from 'react';
import Section from 'components/common/Section';
import ArticleContainer from '../components/ArticleContainer';
import YnetImage from 'assets/imgs/article.png';
const strings = {
  title: 'כתבות - מיכל דורון',
};

const data = {
  title: 'גרפולוגיה בעידן הטכנלוגיה',
  subtitle: 'Ynet, yediot America',
  text: 'בחודש הבא תגיע לשיקגו הגרפולוגית הישראלית מיכל דורון שתסביר מדוע דווקא היום, הגרפולוגיה רלוונטית מתמיד מיכל דורון, גרפולוגית, משוררת, סופרת, ועיתונאית בעלת תואר ראשון בפילוסופיה ותואר שני במדעי ההתנהגות הקסימה את שיקגו. היא הוזמנה לעיר על ידי נתיבה כפתורי שארגנה את הרצאתה. דורון היא אישיות ציורית הנושאת על ראשה שני כובעים המשלבים בין הגרפולוגיה לתחומי הספרות והשירה. לפיכך הרצתה לנשות חוג הספר העברי בשיקגו על הנושא החביב עליה: ניתוח כתבי ידם של משוררים וסופרים ובעיקר על הקשר בין כתב ליצירה. זו הייתה הרצאה מיוחדת במינה :שפתחה בפנינו עולם חדש. הרושם שהיה לי משמיעת הרצאתה היה שהלב שלה במקום הנכון ומילותיה במקום הנכון .מיזוג מרתק של אתיקה ומקצועיות ,דורון עובדת בקצב מסחרר כגרפולוגית מעל לשלושים שנה בתחום העסקי. היא מספקת ייעוץ לחברות עסקים וארגונים הכוונה תעסוקתית לבודדים, כמו כן, מתמחה בגרפולוגיה משפטית והשוואת חתימות וכתבי יד. בין השאר פרסמה שני .ספרים "על ספת הגרפולוג" הוצאת עקד (2004) וספר השירים "בקרום הדק" (2010) זוכה בפרס הוקרה על שם דוד לויתן לעיתים קרובות פרסמה מאמרים בירחוני ספרות. בין היתר מכהנת כיו"ר הוועדה לגרפולוגיה משפטית של .האגודה לגרפולוגיה מדעית וכיו"ר ועדת האתיקה של אגודת הסופרים, תפקיד שהיא מכהנת קדנציה שנייה בכובע המשוררת גרפולוג חייב לדעת מראש את יד הכתיבה (שמאלית או ימנית), מין, גיל ומצבו הרפואי של האדם". הבהירה דורון. " כתב" היד מאיר אור על אישיות האדם. אני נקראת להכין פרופיל אישיות למועמדים למשרות בחברות. הפרטים הנכללים במלאכת מחשבת זו הינם: אינטליגנציה, תכונות התנהגות, אופי, כישורים, יחסי אנוש, אלתור, תמרון, עמידה במצבי לחץ, כושר מכירה , וכן אמינות ויושר". התכונות מתגלות על פי פרמטרים רבים כגון: שוליים, מהירות כתיבה, רווחים בין האותיות ובין המילים ". לחץ היד, קו הכתב, זווית הכתיבה וגודל הכתב. בין השאר נדרש ידע מתורת הפסיכולוגיה על מבנה אישיות האדם .תחושת העוצמה של המקצוע מורגשת בפתיחת הרצאתה הגדירה דורון מהי גרפולוגיה. להגדרתה, זהו מדע תורת הכתיבה הקושר בין כתב ידו של אדם לבין תכונות שונות באישיותו. שורשיה הנצו כבר במאה השבע עשרה כמדע אימפירי ובעת העתיקה נמצאו הוגי דעות כמו קונפוציוס שכתב: " היזהר לך מפני אדם שכתב ידו מתנועע כקנה סוף ברוח.״ לייבניץ, אחד מהוגי חשובים, ציין שכתב היד מביע את . האופי שלנו בכרך השישי של כתביו. לדעת דורון מדע זה הינו חלק ממדעי ההתנהגות ולו יכולת ניבוי השואפת ל-80% דיוק .הגרפולוג בוחן את הקשר בין המוח, העין, והיד". סיכמה דורון" בהרצאתה סקרה את תכונות האופי של משוררים קלסיים כנתן אלתרמן, אברהם שלונסקי, שאול טשרניחובסקי, חיים נחמן ביאליק, לאה גולדברג, חנוך לוין, אלכסנדר פן והראתה את כישרונם, רבגוניותם ותכונות אופיים. דורון בחנה רק את כתב .ידם ולא העירה על סגנון ותוכן כתיבתם. היא חשפה את הרבדים העמוקים בנפשם, את כישרונותיהם וחוזקותיהם . לדעתה אין כתב יד אופייני לסופרים. לדבריה, המכנה המשותף באישיות כל הסופרים הינו מורכבות, ניגודיות, והתייסרות אישית . יצירתם מונעת ממאבק, בעירה וחיפוש פנימי. חשבתי, מה היה קורה לו היו באים אלי לקליניקה ומבקשים הכוונה מקצועית" שאול טשרניחובסקי בעל הכתב המהיר והיצרי וחיים נחמן ביאליק הזהיר, קפדן ושמרן בוודאי היו זוכים לייעוץ לעסוק במקצועות ".שונים שיתאימו למזגם בתחום הגרפולוגיה המשפטית דורון כותבת חוות דעת באמצעות השוואת חתימות וכתבי יד ובדיקת זיופים. היא מעידה בבתי משפט על אמינות ויושר ומכינה עורכי דין לחקירה נגדית". דורון חלקה עם הקבוצה מקרה של אדם שסרב לתת גט לאשתו העגונה בטענה שרצונו בשלום בית. מכתבי אהבה לנשים אחרות שנמצאו בבית ונמסרו לדורון לבדיקה הוכיחו שהבעל יצא .לרעות בשדות זרים. שלושת הרבנים הכריעו והאישה נגאלה מעגינותה . דורון גם עוסקת שנים בייעוץ להכוונה מקצועית לאנשים. קצרה היריעה מלספר לכמה לאנשים סייעה בהכוונה מקצועית הגיעו אליה אנשים במצוקה ממקומות עבודה שרמסו את דימויים העצמי. אנשים שהשתלבו במקומות עבודה בשל לחץ .חברתי ובאבחון כתב ניתן לכוונם למקומות אחרים המתאימים לאופיים . בתחום הבינאישי, דורון מייעצת לזוגות העומדים להינשא. היא נזהרת ואינה מביעה דעה על התאמה הכימיה, התשוקה המופלאה בין זוגות, זה עניין אישי" הסבירה. "כמו כן, מבחינה אתית, אסור להראות כתב יד של אדם" .ללא הסכמתו, אלא במקרים חריגים של פיקוח נפש״ . רצח וניסיונות לרצח של נשים בדגש על אלימות במשפחה מרקיע שחקים בישראל מידי שנה, 51% ממקרי הרצח של נשים שנרצחו בישראל היו בידי בני זוגם. בעבר, הגיעה אליה אמא עם ביתה אשר עמדה להינשא לבחור שהסכים שכתב ידו ייבחן. לשיברון ליבה של הבת, גילתה דורון סימני אלימות ורכושנות קשים ביותר בכתב היד ודיווחה למשפחה. לאחר מספר שנים פגשה את אותה נערה מאושרת עם בן זוג אחר. היא רוצה .להאמין שאולי הייתה זו התערבותה שהשפיעה ובכך לא התווסף אחוז נוסף לסטטיסטיקה דורון, ילידת תל-אביב, בת להורים ילידי העיר ולסבים שעלו מרוסיה בכדי לבנות ולהיבנות. התעניינותה בכתבי יד החלו . עוד משחר ילדותה. לדבריה, בפגישה מחודשת עם חברת ילדות שסיפרה לה שהיא מהנדסת כבישים, דורון לא התפלאה היא זכרה את אותיותיה העבות והעגולות בכתיבתה. גם כתב ידם של יתר חברי הכיתה הדהד בראשה. היא זכרה את כתב .ידו המתנדנד של הנער שחבבה בעת שירותה הצבאי כמאבחנת לקורס טייס בחיל האויר, הזדמנה דורון לשיעור גרפולוגיה ונדלקה. היא נרשמה לתואר ראשון .בפילוסופיה ובמקביל למדה שלוש שנים גרפולוגיה. לאחר מכן השלימה את התואר השני בפסיכולוגיה ומשם הכל היסטוריה , במקביל לעבודה בגרפולוגיה, היא עוסקת ביצירה. הכתיבה ממלאת את עולמה ומסבה לה אושר רב. בימים אלו .היא עובדת על ספרה השני "על ספת הגרפולוג 2". בקרוב יצא לאור ספר שירה פרי עטה, "אסירת החופש" וספר סיפורים קצרים היום, בעידן הטכנולוגי, אנשים לא כותבים", ציינתי. "כולנו מדפיסים". "בכל מקרה״, היא מסבירה, ״קיים מרכז כתיבה במוח ולכן" . הגרפולוגיה לא נכחדת". "הגרפולוגיה היא נצחית. גרפולוגיה נלמדת במסגרות פרטיות המוכרות על ידי האגודה לגרפולוגיה מדעית חלומי הוא הקמת בית ספר גדול לגרפולוגיה והכרה אקדמית של המקצוע - מן הראוי שתהיה תוכנית בת שלוש שנים ושנה .והתמחות לתואר ראשון. בחודש אוקטובר תגיע דורון לעיר הרוחות להרצאה נוספת. היכונו',
  img: YnetImage,
};
export const Articles = () => {
  return (
    <Section>
      <div className="flex flex-col items-center mb-9">
        <h1 className="_text-bold-dark-8xl">{strings.title}</h1>
        <div className="flex flex-col divide-y-4 divide-p-brown w-1/3">
          <span></span>
          <span></span>
        </div>
        <div className="grid grid-cols-3 pt-16  gap-28">
          <ArticleContainer item={data} />
          <ArticleContainer item={data} />
          <ArticleContainer item={data} />
          <ArticleContainer item={data} />
          <ArticleContainer item={data} />
          <ArticleContainer item={data} />
          <ArticleContainer item={data} />
          <ArticleContainer item={data} />
          <ArticleContainer item={data} />
        </div>
      </div>
    </Section>
  );
};
